[
    {
        "heading": "Afghanistan",
        "languageInfo": "Afghan Persian or Dari (official, lingua franca) 77%, Pashto (official) 48%, Uzbeki 11%, English 6%, Turkmani 3%, Urdu 3%, Pachaie 1%, Nuristani 1%, Arabic 1%, Balochi 1%, other <1% (2020 est.)major-language sample(s):  کتاب حقایق جهان، مرجعی ضروری برای اطلاعات اولیە (Dari) د دنیا د حقائېقو کتاب، بنیادی معلوماتو لپاره ضروری سرچینه- (Pashto)The World Factbook, the indispensable source for basic information.note 1: percentages sum to more than 100% because many people are multilingual note 2: Uzbeki, Turkmani, Pachaie, Nuristani, Balochi, and Pamiri are the third official languages in areas where the majority speaks them"
    },
    {
        "heading": "Akrotiri",
        "languageInfo": "English, Greekmajor-language sample(s): Το Παγκόσμιο Βιβλίο Δεδομένων, η απαραίτητη πηγή βασικών πληροφοριών. (Greek)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Albania",
        "languageInfo": "Albanian 98.8% (official - derived from Tosk dialect), Greek 0.5%, other 0.6% (including Macedonian, Romani, Vlach, Turkish, Italian, and Serbo-Croatian), unspecified 0.1% (2011 est.)major-language sample(s): Libri i fakteve boterore, burimi i pazevendesueshem per informacione elementare (Albanian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Algeria",
        "languageInfo": "Arabic (official), French (lingua franca), Berber or Tamazight (official); dialects include Kabyle Berber (Taqbaylit), Shawiya Berber (Tacawit), Mzab Berber, Tuareg Berber (Tamahaq)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "American Samoa",
        "languageInfo": "Samoan 87.9% (closely related to Hawaiian and other Polynesian languages), English 3.3%, Tongan 2.1%, other Pacific Islander 4.1%, Asian languages 2.1%, other 0.5% (2010 est.)note: most people are bilingual"
    },
    {
        "heading": "Andorra",
        "languageInfo": "Catalan (official) 35.7%, Castilian 43.2%, Portuguese 17.1%, French 8.9%, English 1.8%, other 5% (2018 est.)note: data represent mother tongue"
    },
    {
        "heading": "Angola",
        "languageInfo": "Portuguese 71.2% (official), Umbundu 23%, Kikongo 8.2%, Kimbundu 7.8%, Chokwe 6.5%, Nhaneca 3.4%, Nganguela 3.1%, Fiote 2.4%, Kwanhama 2.3%, Muhumbi 2.1%, Luvale 1%, other 3.6%; note - data represent most widely spoken languages; shares sum to more than 100% because some respondents gave more than one answer on the census (2014 est.)"
    },
    { "heading": "Anguilla", "languageInfo": "English (official)" },
    {
        "heading": "Antigua and Barbuda",
        "languageInfo": "English (official), Antiguan Creole (an English-based creole)"
    },
    {
        "heading": "Argentina",
        "languageInfo": "Spanish (official), Italian, English, German, French, indigenous (Quechua, Guarani, Mapudungun)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Armenia",
        "languageInfo": "Armenian (official) 97.9%, Kurmanji (spoken by Yezidi minority) 1%, other 1.1%; note - Russian is widely spoken (2011 est.)major-language sample(s): Աշխարհի Փաստագիրք, Անփոխարինելի Աղբյւր Հիմնական Տեղեկատվւթյան. (Armenian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Aruba",
        "languageInfo": "Papiamento (official) (a creole language that is a mixture of Portuguese, Spanish, Dutch, English, and, to a lesser extent, French, as well as elements of African languages and the language of the Arawak) 69.4%, Spanish 13.7%, English (widely spoken) 7.1%, Dutch (official) 6.1%, Chinese 1.5%, other 1.7%, unspecified 0.4% (2010 est.)"
    },
    {
        "heading": "Australia",
        "languageInfo": "English 72%, Mandarin 2.7%, Arabic 1.4%, Vietnamese 1.3%, Cantonese 1.2%, other 15.7%, unspecified 5.7% (2021 est.)note: data represent language spoken at home"
    },
    {
        "heading": "Austria",
        "languageInfo": "German (official nationwide) 88.6%, Turkish 2.3%, Serbian 2.2%, Croatian (official in Burgenland) 1.6%, other (includes Slovene, official in southern Carinthia, and Hungarian, official in Burgenland) 5.3% (2001 est.)major-language sample(s): Das World Factbook, die unverzichtbare Quelle für grundlegende Informationen. (German)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Azerbaijan",
        "languageInfo": "Azerbaijani (Azeri) (official) 92.5%, Russian 1.4%, Armenian 1.4%, other 4.7% (2009 est.)major-language sample(s): Dünya fakt kitabı, əsas məlumatlar üçün əvəz olunmaz mənbədir (Azerbaijani)The World Factbook, the indispensable source for basic information.note: Russian is widely spoken"
    },
    {
        "heading": "Bahamas, The",
        "languageInfo": "English (official), Creole (among Haitian immigrants)"
    },
    {
        "heading": "Bahrain",
        "languageInfo": "Arabic (official), English, Farsi, Urdumajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Bangladesh",
        "languageInfo": "Bangla 98.8% (official, also known as Bengali), other 1.2% (2011 est.)major-language sample(s): বিশ্ব ফ্যাক্টবুক, মৌলিক তথ্যের অপরিহার্য উৎস (Bangla) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Barbados",
        "languageInfo": "English (official), Bajan (English-based creole language, widely spoken in informal settings)"
    },
    {
        "heading": "Belarus",
        "languageInfo": "Russian (official) 71.4%, Belarusian (official) 26%, other 0.3% (includes small Polish- and Ukrainian-speaking minorities), unspecified 2.3% (2009 est.)major-language sample(s): Книга фактов о мире – незаменимый источник базовой информации. (Russian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Belgium",
        "languageInfo": "Dutch (official) 60%, French (official) 40%, German (official) less than 1%major-language sample(s): Het Wereld Feitenboek, een onmisbare bron van informatie. (Dutch)The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Belize",
        "languageInfo": "English 62.9% (official), Spanish 56.6%, Creole 44.6%, Maya 10.5%, German 3.2%, Garifuna 2.9%, other 1.8%, unknown 0.5%; note - shares sum to more than 100% because some respondents gave more than one answer on the census (2010 est.)major-language sample(s): The World Factbook, the indispensable source for basic information. (English)La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)"
    },
    {
        "heading": "Benin",
        "languageInfo": "55 languages; French (official); Fon (a Gbe language) and Yoruba are the most important indigenous languages in the south; half a dozen regionally important languages in the north, including Bariba (once counted as a Gur language) and Fulfulde"
    },
    { "heading": "Bermuda", "languageInfo": "English (official), Portuguese" },
    {
        "heading": "Bhutan",
        "languageInfo": "Sharchopkha 28%, Dzongkha (official) 24%, Lhotshamkha 22%, other 26% (includes foreign languages) (2005 est.)"
    },
    {
        "heading": "Bolivia",
        "languageInfo": "Spanish (official) 68.1%, Quechua (official) 17.2%, Aymara (official) 10.5%, Guarani (official) 0.6%, other 1.5%, unspecified 2.1%; note - Bolivia's 2009 constitution designates Spanish and all indigenous languages as official; 36 indigenous languages are specified, including a few that are extinct (2012 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Bosnia and Herzegovina",
        "languageInfo": "Bosnian (official) 52.9%, Serbian (official) 30.8%, Croatian (official) 14.6%, other 1.6%, no answer 0.2% (2013 est.)major-language sample(s): Knjiga svjetskih činjenica, neophodan izvor osnovnih informacija. (Bosnian)Knjiga svetskih činjenica, neophodan izvor osnovnih informacija. (Serbian)Knjiga svjetskih činjenica, nužan izvor osnovnih informacija. (Croatian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Botswana",
        "languageInfo": "Setswana 77.3%, Sekalanga 7.4%, Shekgalagadi 3.4%, English (official) 2.8%, Zezuru/Shona 2%, Sesarwa 1.7%, Sembukushu 1.6%, Ndebele 1%, other 2.8% (2011 est.)"
    },
    {
        "heading": "Brazil",
        "languageInfo": "Portuguese (official and most widely spoken language); note - less common languages include Spanish (border areas and schools), German, Italian, Japanese, English, and a large number of minor Amerindian languagesmajor-language sample(s): O Livro de Fatos Mundiais, a fonte indispensável para informação básica. (Brazilian Portuguese)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "British Virgin Islands",
        "languageInfo": "English (official), Virgin Islands Creole"
    },
    {
        "heading": "Brunei",
        "languageInfo": "Malay (Bahasa Melayu) (official), English, Chinese dialectsmajor-language sample(s): Buku Fakta Dunia, sumber yang diperlukan untuk maklumat asas. (Malay)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Bulgaria",
        "languageInfo": "Bulgarian (official) 76.8%, Turkish 8.2%, Romani 3.8%, other 0.7%, unspecified 10.5% (2011 est.)major-language sample(s): Светoвен Алманах, незаменимият източник за основна информация. (Bulgarian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Burkina Faso",
        "languageInfo": "Mossi 52.9%, Fula 7.8%, Gourmantche 6.8%, Dyula 5.7%, Bissa 3.3%, Gurunsi 3.2%, French (official) 2.2%, Bwamu 2%, Dagara 2%, San 1.7%, Marka 1.6%, Bobo 1.5%, Senufo 1.5%, Lobi 1.2%, other 6.6% (2019 est.)"
    },
    {
        "heading": "Burma",
        "languageInfo": "Burmese (official)major-language sample(s): ကမ္ဘာ့အချက်အလက်စာအုပ်- အခြေခံအချက်အလက်တွေအတွက် မရှိမဖြစ်တဲ့ အရင်းအမြစ် (Burmese)The World Factbook, the indispensable source for basic information.note: minority ethnic groups use their own languages"
    },
    {
        "heading": "Burundi",
        "languageInfo": "Kirundi only 29.7% (official); French only 0.3% (official); Swahili only 0.2%; English only 0.1% (official); Kirundi and French 8.4%; Kirundi, French, and English 2.4%, other language combinations 2%, unspecified 56.9% (2008 est.)major-language sample(s): Igitabo Mpuzamakungu c'ibimenyetso bifatika, isoko ntabanduka ku nkuru z'urufatiro. (Kirundi)The World Factbook, the indispensable source for basic information.note: data represent languages read and written by people 10 years of age or older; spoken Kirundi is nearly universal"
    },
    {
        "heading": "Cabo Verde",
        "languageInfo": "Portuguese (official), Krioulo (a Portuguese-based Creole language with two main dialects spoken in Cabo Verde and in the Cabo Verdean diaspora worldwide)"
    },
    {
        "heading": "Cambodia",
        "languageInfo": "Khmer (official) 95.8%, minority languages 2.9%, Chinese 0.6%, Vietnamese 0.5%, other 0.2% (2019 est.)major-language sample(s): សៀវភៅហេតុការណនៅលើពិភពលោក។ ទីតាំងពត៏មានមូលដានគ្រឹះយាងសំខាន់។. (Khmer)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Cameroon",
        "languageInfo": "24 major African language groups, English (official), French (official)major-language sample(s): The World Factbook, the indispensable source for basic information. (English)The World Factbook, une source indispensable d'informations de base. (French)"
    },
    {
        "heading": "Canada",
        "languageInfo": "English (official) 87.1%, French (official) 29.1%, Chinese languages 4.2%, Spanish 3.2%, Punjabi 2.6%, Arabic 2.4%, Tagalog 2.3%, Italian 1.5% (2022 est.)major-language sample(s): The World Factbook, the indispensable source for basic information. (English)The World Factbook, une source indispensable d'informations de base. (French)"
    },
    {
        "heading": "Cayman Islands",
        "languageInfo": "English (official) 90.9%, Spanish 4%, Filipino 3.3%, other 1.7%, unspecified 0.1% (2010 est.)"
    },
    {
        "heading": "Central African Republic",
        "languageInfo": "French (official), Sangho (lingua franca and national language), tribal languages"
    },
    {
        "heading": "Chad",
        "languageInfo": "French (official), Arabic (official), Sara (in south), more than 120 different languages and dialectsmajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Chile",
        "languageInfo": "Spanish 99.5% (official), English 10.2%, Indigenous 1% (includes Mapudungun, Aymara, Quechua, Rapa Nui), other 2.3%, unspecified 0.2%; note - shares sum to more than 100% because some respondents gave more than one answer on the census (2012 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "China",
        "languageInfo": "Standard Chinese or Mandarin (official; Putonghua, based on the Beijing dialect), Yue (Cantonese), Wu (Shanghainese), Minbei (Fuzhou), Minnan (Hokkien-Taiwanese), Xiang, Gan, Hakka dialects, minority languages (see Ethnic groups entry); note - Zhuang is official in Guangxi Zhuang, Yue is official in Guangdong, Mongolian is official in Nei Mongol, Uyghur is official in Xinjiang Uygur, Kyrgyz is official in Xinjiang Uyghur, and Tibetan is official in Xizang (Tibet)major-language sample(s): 世界概況  –  不可缺少的基本消息來源 (Standard Chinese)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Christmas Island",
        "languageInfo": "English (official) 27.6%, Mandarin 17.2%, Malay 17.1%, Cantonese 3.9%, Min Nan 1.6%, Tagalog 1%, other 4.5%, unspecified 27.1% (2016 est.)note: data represent language spoken at home"
    },
    {
        "heading": "Cocos (Keeling) Islands",
        "languageInfo": "Malay (Cocos dialect) 68.8%, English 22.3%, unspecified 8.9%; note - data represent language spoken at home (2016 est.)major-language sample(s): Buku Fakta Dunia, sumber yang diperlukan untuk maklumat asas. (Malay)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Colombia",
        "languageInfo": "Spanish (official) and 65 Amerindian languagesmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Comoros",
        "languageInfo": "Arabic (official), French (official), Shikomoro (official; similar to Swahili) (Comorian)"
    },
    {
        "heading": "Congo, Democratic Republic of the",
        "languageInfo": "French (official), Lingala (a lingua franca trade language), Kingwana (a dialect of Kiswahili or Swahili), Kikongo, Tshilubamajor-language sample(s): Buku oyo ya bosembo ya Mokili Mobimba Ezali na Makanisi ya Liboso Mpenza. (Lingala)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Congo, Republic of the",
        "languageInfo": "French (official), French Lingala and Monokutuba (lingua franca trade languages), many local languages and dialects (of which Kikongo is the most widespread)major-language sample(s): Buku oyo ya bosembo ya Mokili Mobimba Ezali na Makanisi ya Liboso Mpenza. (Lingala)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Cook Islands",
        "languageInfo": "English (official) 86.4%, Cook Islands Maori (Rarotongan) (official) 76.2%, other 8.3% (2011 est.)note: shares sum to more than 100% because some respondents gave more than one answer on the census"
    },
    {
        "heading": "Costa Rica",
        "languageInfo": "Spanish (official), Englishmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Cote d'Ivoire",
        "languageInfo": "French (official), 60 native dialects of which Dioula is the most widely spokenmajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Croatia",
        "languageInfo": "Croatian (official) 95.6%, Serbian 1.2%, other 3% (including Hungarian, Czech, Slovak, and Albanian), unspecified 0.2% (2011 est.)major-language sample(s): Knjiga svjetskih činjenica, nužan izvor osnovnih informacija. (Croatian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Cuba",
        "languageInfo": "Spanish (official)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Curacao",
        "languageInfo": "Papiamento (official) (a creole language that is a mixture of Portuguese, Spanish, Dutch, English, and, to a lesser extent, French, as well as elements of African languages and the language of the Arawak) 80%, Dutch (official) 8.8%, Spanish 5.6%, English (official) 3.1%, other 2.3%, unspecified 0.3% (2011 est.)note: data represent most spoken language in household"
    },
    {
        "heading": "Cyprus",
        "languageInfo": "Greek (official) 80.9%, Turkish (official) 0.2%, English 4.1%, Romanian 2.9%, Russian 2.5%, Bulgarian 2.2%, Arabic 1.2%, Filipino 1.1%, other 4.3%, unspecified 0.6%; note - data represent only the Republic of Cyprus (2011 est.)major-language sample(s): Το Παγκόσμιο Βιβλίο Δεδομένων, η απαραίτητη πηγή βασικών πληροφοριών. (Greek)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Czechia",
        "languageInfo": "Czech (official) 88.4%, Slovak 1.5%, other 2.6%, unspecified 7.2%note: includes only persons with one mother tongue (2021 est.)major-language sample(s): World Fackbook, nepostradatelný zdroj základních informací. (Czech)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Denmark",
        "languageInfo": "Danish, Faroese, Greenlandic (an Inuit dialect), German (small minority); note - English is the predominant second languagemajor-language sample(s): Verdens Faktabog, den uundværlig kilde til grundlæggende oplysninger. (Danish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Dhekelia",
        "languageInfo": "English, Greekmajor-language sample(s): Το Παγκόσμιο Βιβλίο Δεδομένων, η απαραίτητη πηγή βασικών πληροφοριών. (Greek)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Djibouti",
        "languageInfo": "French (official), Arabic (official), Somali, Afar"
    },
    {
        "heading": "Dominica",
        "languageInfo": "English (official), French patois"
    },
    {
        "heading": "Dominican Republic",
        "languageInfo": "Spanish (official)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Ecuador",
        "languageInfo": "Spanish (Castilian) 93% (official), Quechua 4.1%, other indigenous 0.7%, foreign 2.2%; note - (Quechua and Shuar are official languages of intercultural relations; other indigenous languages are in official use by indigenous peoples in the areas they inhabit) (2010 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Egypt",
        "languageInfo": "Arabic (official), English, and French widely understood by educated classesmajor-language sample(s): كتاب حقائق العالم، أفضل مصدر للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "El Salvador",
        "languageInfo": "Spanish (official), Nawat (among some Amerindians)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Equatorial Guinea",
        "languageInfo": "Spanish (official) 67.6%, other (includes Fang, Bubi, Portuguese (official), French (official), Portuguese-based Creoles spoken in Ano Bom) 32.4% (1994 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Eritrea",
        "languageInfo": "Tigrinya (official), Arabic (official), English (official), Tigre, Kunama, Afar, other Cushitic languages"
    },
    {
        "heading": "Estonia",
        "languageInfo": "Estonian (official) 68.5%, Russian 29.6%, Ukrainian 0.6%, other 1.2%, unspecified 0.1% (2011 est.)"
    },
    {
        "heading": "Eswatini",
        "languageInfo": "English (official, used for government business), siSwati (official)"
    },
    {
        "heading": "Ethiopia",
        "languageInfo": "Oromo (official working language in the State of Oromiya) 33.8%, Amharic (official national language) 29.3%, Somali (official working language of the State of Sumale) 6.2%, Tigrigna (Tigrinya) (official working language of the State of Tigray) 5.9%, Sidamo 4%, Wolaytta 2.2%, Gurage 2%, Afar (official working language of the State of Afar) 1.7%, Hadiyya 1.7%, Gamo 1.5%, Gedeo 1.3%, Opuuo 1.2%, Kafa 1.1%, other 8.1%, English (major foreign language taught in schools), Arabic (2007 est.)major-language sample(s): Kitaaba Addunyaa Waan Qabataamaatiif - Kan Madda Odeeffannoo bu’uraawaatiif baay’ee barbaachisaa ta’e. (Oromo)የአለም እውነታ መጽሐፍ፣ ለመሠረታዊ መረጃ እጅግ አስፈላጊ የሆነ ምንጭ። (Amharic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "European Union",
        "languageInfo": "Bulgarian, Croatian, Czech, Danish, Dutch, English, Estonian, Finnish, French, German, Greek, Hungarian, Irish, Italian, Latvian, Lithuanian, Maltese, Polish, Portuguese, Romanian, Slovak, Slovene, Spanish, Swedishnote: only the 24 official languages are listed; German, the major language of Germany and Austria, is the most widely spoken mother tongue - about 16% of the EU population; English is the most widely spoken foreign language - about 29% of the EU population is conversant with it; English is an official language in Ireland and Malta and thus remained an official EU language after the UK left the bloc (2020)"
    },
    {
        "heading": "Falkland Islands (Islas Malvinas)",
        "languageInfo": "English 89%, Spanish 7.7%, other 3.3% (2006 est.)"
    },
    {
        "heading": "Faroe Islands",
        "languageInfo": "Faroese 93.8% (derived from Old Norse), Danish 3.2%, other 3% (2011 est.)note:  data represent population by primary language"
    },
    {
        "heading": "Fiji",
        "languageInfo": "English (official), iTaukei (official), Fiji Hindi (official)"
    },
    {
        "heading": "Finland",
        "languageInfo": "Finnish (official) 86.5%, Swedish (official) 5.2%, Russian 1.6%, other 6.7% (2021 est.)major-language sample(s): World Factbook, korvaamaton perustietolähde. (Finnish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "France",
        "languageInfo": "French (official) 100%, declining regional dialects and languages (Provencal, Breton, Alsatian, Corsican, Catalan, Basque, Flemish, Occitan, Picard); note - overseas departments: French, Creole patois, Mahorian (a Swahili dialect)major-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "French Polynesia",
        "languageInfo": "French (official) 73.5%, Tahitian 20.1%, Marquesan 2.6%, Austral languages 1.2%, Paumotu 1%, other 1.6% (2017 est.)major-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Gabon",
        "languageInfo": "French (official), Fang, Myene, Nzebi, Bapounou/Eschira, Bandjabi"
    },
    {
        "heading": "Gambia, The",
        "languageInfo": "English (official), Mandinka, Wolof, Fula, other indigenous vernaculars"
    },
    {
        "heading": "Gaza Strip",
        "languageInfo": "Arabic, Hebrew (spoken by many Palestinians), English (widely understood)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Georgia",
        "languageInfo": "Georgian (official) 87.6%, Azeri 6.2%, Armenian 3.9%, Russian 1.2%, other 1%; note - Abkhaz is the official language in Abkhazia (2014 est.)major-language sample(s): მსოფლიო ფაქტების წიგნი, ძირითადი ინფორმაციის აუცილებელი წყარო. (Georgian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Germany",
        "languageInfo": "German (official); note - Danish, Frisian, Sorbian, and Romani are official minority languages; Low German, Danish, North Frisian, Sater Frisian, Lower Sorbian, Upper Sorbian, and Romani are recognized as regional languages under the European Charter for Regional or Minority Languagesmajor-language sample(s): Das World Factbook, die unverzichtbare Quelle für grundlegende Informationen. (German)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Ghana",
        "languageInfo": "Asante 16%, Ewe 14%, Fante 11.6%, Boron (Brong) 4.9%, Dagomba 4.4%, Dangme 4.2%, Dagarte (Dagaba) 3.9%, Kokomba 3.5%, Akyem 3.2%, Ga 3.1%, other 31.2% (2010 est.)note: English is the official language"
    },
    {
        "heading": "Gibraltar",
        "languageInfo": "English (used in schools and for official purposes), Spanish, Italian, Portuguese"
    },
    {
        "heading": "Greece",
        "languageInfo": "Greek (official) 99%, other (includes English and French) 1%major-language sample(s): Το Παγκόσμιο Βιβλίο Δεδομένων, η απαραίτητη πηγή βασικών πληροφοριών. (Greek)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Greenland",
        "languageInfo": "Greenlandic (West Greenlandic or Kalaallisut is the official language), Danish, English"
    },
    {
        "heading": "Grenada",
        "languageInfo": "English (official), French patois"
    },
    {
        "heading": "Guam",
        "languageInfo": "English 43.6%, Filipino 21.2%, Chamorro 17.8%, other Pacific island languages 10%, Asian languages 6.3%, other 1.1% (2010 est.)"
    },
    {
        "heading": "Guatemala",
        "languageInfo": "Spanish (official) 69.9%, Maya languages 29.7% (Q'eqchi' 8.3%, K'iche 7.8%, Mam 4.4%, Kaqchikel 3%, Q'anjob'al 1.2%, Poqomchi' 1%, other 4%), other 0.4% (includes Xinca and Garifuna); note - the 2003 Law of National Languages officially recognized 23 indigenous languages, including 21 Maya languages, Xinca, and Garifuna (2018 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Guernsey",
        "languageInfo": "English, French, Norman-French dialect spoken in country districts"
    },
    {
        "heading": "Guinea",
        "languageInfo": "French (official), Pular, Maninka, Susu, other native languagesnote: about 40 languages are spoken; each ethnic group has its own language"
    },
    {
        "heading": "Guinea-Bissau",
        "languageInfo": "Portuguese-based Creole, Portuguese (official; largely used as a second or third language), Pular (a Fula language), Mandingo"
    },
    {
        "heading": "Guyana",
        "languageInfo": "English (official), Guyanese Creole, Amerindian languages (including Caribbean and Arawak languages), Indian languages (including Caribbean Hindustani, a dialect of Hindi), Chinese (2014 est.)"
    },
    {
        "heading": "Haiti",
        "languageInfo": "French (official), Creole (official)major-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, sous endispansab pou enfomasyon debaz. (Haitian Creole)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Holy See (Vatican City)",
        "languageInfo": "Italian, Latin, French, various other languagesmajor-language sample(s): L'Almanacco dei fatti del mondo, l'indispensabile fonte per le informazioni di base. (Italian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Honduras",
        "languageInfo": "Spanish (official), Amerindian dialectsmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Hong Kong",
        "languageInfo": "Cantonese (official) 88.9%, English (official) 4.3%, Mandarin (official) 1.9%, other Chinese dialects 3.1%, other 1.9% (2016 est.)major-language sample(s):  世界概况, 必須擁有的基本資料参考书 (Cantonese) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Hungary",
        "languageInfo": "Hungarian (official) 99.6%, English 16%, German 11.2%, Russian 1.6%, Romanian 1.3%, French 1.2%, other 4.2%; note - shares sum to more than 100% because some respondents gave more than one answer on the census; Hungarian is the mother tongue of 98.9% of Hungarian speakers (2011 est.)major-language sample(s): A World Factbook nélkülözhetetlen forrása az alapvető információnak.  (Hungarian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Iceland",
        "languageInfo": "Icelandic, English, Nordic languages, German"
    },
    {
        "heading": "India",
        "languageInfo": "Hindi 43.6%, Bengali 8%, Marathi 6.9%, Telugu 6.7%, Tamil 5.7%, Gujarati 4.6%, Urdu 4.2%, Kannada 3.6%, Odia 3.1%, Malayalam 2.9%, Punjabi 2.7%, Assamese 1.3%, Maithili 1.1%, other 5.6%; note - English enjoys the status of subsidiary official language but is the most important language for national, political, and commercial communication; there are 22 other officially recognized languages: Assamese, Bengali, Bodo, Dogri, Gujarati, Hindi, Kannada, Kashmiri, Konkani, Maithili, Malayalam, Manipuri, Marathi, Nepali, Odia, Punjabi, Sanskrit, Santali, Sindhi, Tamil, Telugu, Urdu; Hindustani is a popular variant of Hindi/Urdu spoken widely throughout northern India but is not an official language (2011 est.)major-language sample(s): विश्व फ़ैक्टबुक, आधारभूत जानकारी का एक अनिवार्य स्रोत (Hindi) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Indonesia",
        "languageInfo": "Bahasa Indonesia (official, modified form of Malay), English, Dutch, local dialects (of which the most widely spoken is Javanese); note - more than 700 languages are used in Indonesiamajor-language sample(s): Fakta Dunia, sumber informasi dasar yang sangat diperlukan. (Indonesian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Iran",
        "languageInfo": "Persian"
    },
    {
        "heading": "Iraq",
        "languageInfo": "Arabic (official), Kurdish (official); Turkmen (a Turkish dialect) and Syriac (Neo-Aramaic) are recognized as official languages where native speakers of these languages are present; Iraqis have the right to be educated in their native languagemajor-language sample(s): كتاب حقائق العالم، أحسن مصدر للمعلومات الأساسية (Arabic)ڕاستییەکانی جیهان، باشترین سەرچاوەیە بۆ زانیارییە بنەڕەتییەکان (Kurdish) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Ireland",
        "languageInfo": "English (official, the language generally used), Irish (Gaelic or Gaeilge) (official, spoken by approximately 39.8% of the population as of 2016; mainly spoken in areas along Ireland's western coast known as gaeltachtai, which are officially recognized regions where Irish is the predominant language)"
    },
    {
        "heading": "Isle of Man",
        "languageInfo": "English, Manx Gaelic (about 2% of the population has some knowledge)"
    },
    {
        "heading": "Israel",
        "languageInfo": "Hebrew (official), Arabic (special status under Israeli law), English (most commonly used foreign language)major-language sample(s): ספר עובדות העולם, המקור החיוני למידע בסיסי (Hebrew)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Italy",
        "languageInfo": "Italian (official), German (parts of Trentino-Alto Adige region are predominantly German-speaking), French (small French-speaking minority in Valle d'Aosta region), Slovene (Slovene-speaking minority in the Trieste-Gorizia area)major-language sample(s): L'Almanacco dei fatti del mondo, l'indispensabile fonte per le informazioni di base. (Italian)The World Factbook, the indispensable source for basic information."
    },
    { "heading": "Jamaica", "languageInfo": "English, Jamaican patois" },
    {
        "heading": "Japan",
        "languageInfo": "Japanesemajor-language sample(s): 必要不可欠な基本情報の源、ワールド・ファクトブック(Japanese)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Jersey",
        "languageInfo": "English (official) 94.5%, Portuguese 4.6%, other 0.9% (includes French (official) and Jerriais) (2001 est.)note: data represent main spoken language; the traditional language of Jersey is Jerriais or Jersey French (a Norman language), which was spoken by fewer than 3,000 people as of 2001;  two thirds of Jerriais speakers are aged 60 and over"
    },
    {
        "heading": "Jordan",
        "languageInfo": "Arabic (official), English (widely understood among upper and middle classes)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Kazakhstan",
        "languageInfo": "Kazakh (official, Qazaq) 83.1% (understand spoken language) and trilingual (Kazakh, Russian, English) 22.3% (2017 est.); Russian (official, used in everyday business, designated the \"language of interethnic communication\") 94.4% (understand spoken language) (2009 est.)major-language sample(s): Әлемдік деректер кітабы, негізгі ақпараттың таптырмайтын көзі. (Kazakh)Книга фактов о мире – незаменимый источник базовой информации. (Russian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Kenya",
        "languageInfo": "English (official), Kiswahili (official), numerous indigenous languagesmajor-language sample(s): The World Factbook, the indispensable source for basic information. (English)The World Factbook, Chanzo cha Lazima Kuhusu Habari ya Msingi. (Kiswahili)"
    },
    { "heading": "Kiribati", "languageInfo": "Gilbertese, English (official)" },
    {
        "heading": "Korea, North",
        "languageInfo": "Koreanmajor-language sample(s): 월드 팩트북, 필수적인 기본 정보 제공처 (Korean)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Korea, South",
        "languageInfo": "Korean, English (widely taught in elementary, junior high, and high school)major-language sample(s): 월드 팩트북, 필수적인 기본 정보 제공처 (Korean)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Kosovo",
        "languageInfo": "Albanian (official) 94.5%, Bosnian 1.7%, Serbian (official) 1.6%, Turkish 1.1%, other 0.9% (includes Romani), unspecified 0.1%; note - in municipalities where a community's mother tongue is not one of Kosovo's official languages, the language of that community may be given official status according to the 2006 Law on the Use of Languagesnote: these estimates may under-represent Serb, Romani, and some other ethnic minority languages because they are based on the 2011 Kosovo national census, which excluded northern Kosovo (a largely Serb-inhabited region) and was partially boycotted by Serb and Romani communities in southern Kosovo (2011 est.)major-language sample(s): Libri i fakteve boterore, burimi i pazevendesueshem per informacione elementare (Albanian)Knjiga svetskih činjenica, neophodan izvor osnovnih informacija. (Serbian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Kuwait",
        "languageInfo": "Arabic (official), English widely spokenmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Kyrgyzstan",
        "languageInfo": "Kyrgyz (official) 71.4%, Uzbek 14.4%, Russian (official) 9%, other 5.2% (2009 est.)major-language sample(s): Дүйнөлүк фактылар китеби, негизги маалыматтын маанилүү булагы. (Kyrgyz)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Laos",
        "languageInfo": "Lao (official), French, English, various ethnic languagesmajor-language sample(s): ແຫລ່ງທີ່ຂາດບໍ່ໄດ້ສຳລັບຂໍ້ມູນຕົ້ນຕໍ່” (Lao)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Latvia",
        "languageInfo": "Latvian (official) 56.3%, Russian 33.8%, other 0.6% (includes Polish, Ukrainian, and Belarusian), unspecified 9.4%; note - data represent language usually spoken at home (2011 est.)major-language sample(s): World Factbook, neaizstājams avots pamata informāciju. (Latvian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Lebanon",
        "languageInfo": "Arabic (official), French, English, Armenianmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Lesotho",
        "languageInfo": "Sesotho (official) (southern Sotho), English (official), Zulu, Xhosa"
    },
    {
        "heading": "Liberia",
        "languageInfo": "English 20% (official), some 20 ethnic group languages few of which can be written or used in correspondence"
    },
    {
        "heading": "Libya",
        "languageInfo": "Arabic (official), Italian, English (all widely understood in the major cities); Berber (Nafusi, Ghadamis, Suknah, Awjilah, Tamasheq)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Liechtenstein",
        "languageInfo": "German 91.5% (official) (Alemannic is the main dialect), Italian 1.5%, Turkish 1.3%, Portuguese 1.1%, other 4.6% (2015 est.)major-language sample(s): Das World Factbook, die unverzichtbare Quelle für grundlegende Informationen. (German)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Lithuania",
        "languageInfo": "Lithuanian (official) 85.3%, Russian 6.8%, Polish 5.1%, other 1.1%, two mother tongues 1.7% (2021 est.)major-language sample(s): Pasaulio enciklopedija – naudingas bendrosios informacijos šaltinis. (Lithuanian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Luxembourg",
        "languageInfo": "Luxembourgish (official administrative and judicial language and national language (spoken vernacular)) 55.8%, Portuguese 15.7%, French (official administrative, judicial, and legislative language) 12.1%, German (official administrative and judicial language) 3.1%, Italian 2.9%, English 2.1%, other 8.4% (2011 est.)"
    },
    {
        "heading": "Macau",
        "languageInfo": "Cantonese 80.1%, Mandarin 5.5%, other Chinese dialects 5.3%, Tagalog 3%, English 2.8%, Portuguese 0.6%, other 2.8%; note - Chinese and Portuguese are official languages; Macanese, a Portuguese-based Creole, is also spoken (2016 est.)major-language sample(s):  世界概况, 必須擁有的基本資料参考书 (Cantonese) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Madagascar",
        "languageInfo": "Malagasy (official) 99.9%, French (official) 23.6%, English 8.2%, other 0.6% (2018 est.)note: shares sum to more than 100% because some respondents gave more than one answer on the census"
    },
    {
        "heading": "Malawi",
        "languageInfo": "English (official), Chewa (common), Lambya, Lomwe, Ngoni, Nkhonde, Nyakyusa, Nyanja, Sena, Tonga, Tumbuka, Yaonote: Chewa and Nyanja are mutually intelligible dialects; Nkhonde and Nyakyusa are mutually intelligible dialects"
    },
    {
        "heading": "Malaysia",
        "languageInfo": "Bahasa Malaysia (official), English, Chinese (Cantonese, Mandarin, Hokkien, Hakka, Hainan, Foochow), Tamil, Telugu, Malayalam, Panjabi, Thai; note - Malaysia has 134 living languages - 112 indigenous languages and 22 non-indigenous languages; in East Malaysia, there are several indigenous languages; the most widely spoken are Iban and Kadazanmajor-language sample(s): Buku Fakta Dunia, sumber yang diperlukan untuk maklumat asas. (Bahasa Malaysia)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Maldives",
        "languageInfo": "Dhivehi (official, dialect of Sinhala, script derived from Arabic), English (spoken by most government officials)"
    },
    {
        "heading": "Mali",
        "languageInfo": "French (official), Bambara 46.3%, Peuhl/Foulfoulbe 9.4%, Dogon 7.2%, Maraka/Soninke 6.4%, Malinke 5.6%, Sonrhai/Djerma 5.6%, Minianka 4.3%, Tamacheq 3.5%, Senoufo 2.6%, Bobo 2.1%, other 6.3%, unspecified 0.7% (2009 est.)note: Mali has 13 national languages in addition to its official language"
    },
    {
        "heading": "Malta",
        "languageInfo": "Maltese (official) 90.1%, English (official) 6%, multilingual 3%, other 0.9% (2005 est.)"
    },
    {
        "heading": "Marshall Islands",
        "languageInfo": "Marshallese (official) 98.2%, other languages 1.8% (1999 est.)major-language sample(s): Bok eo an Lalin kin Melele ko Rejimwe ej jikin ebōk melele ko raurōk. (Marshallese)The World Factbook, the indispensable source for basic information.note: English (official), widely spoken as a second language"
    },
    {
        "heading": "Mauritania",
        "languageInfo": "Arabic (official and national), Pular, Soninke, Wolof (all national languages), French; note - the spoken Arabic in Mauritania differs considerably from the Modern Standard Arabic used for official written purposes or in the media; the Mauritanian dialect, which incorporates many Berber words, is referred to as Hassaniyamajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Mauritius",
        "languageInfo": "Creole 86.5%, Bhojpuri 5.3%, French 4.1%, two languages 1.4%, other 2.6% (includes English, one of the two official languages of the National Assembly, which is spoken by less than 1% of the population), unspecified 0.1% (2011 est.)"
    },
    {
        "heading": "Mexico",
        "languageInfo": "Spanish only 93.8%, Spanish and indigenous languages 5.4%, indigenous only 0.6%, unspecified 0.2%; note - indigenous languages include various Mayan, Nahuatl, and other regional languages (2020 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Micronesia, Federated States of",
        "languageInfo": "English (official and common language), Chuukese, Kosrean, Pohnpeian, Yapese, Ulithian, Woleaian, Nukuoro, Kapingamarangi"
    },
    {
        "heading": "Moldova",
        "languageInfo": "Moldovan/Romanian 80.2% (official) (56.7% identify their mother tongue as Moldovan, which is virtually the same as Romanian; 23.5% identify Romanian as their mother tongue), Russian 9.7%, Gagauz 4.2% (a Turkish language), Ukrainian 3.9%, Bulgarian 1.5%, Romani 0.3%, other 0.2% (2014 est.); note - data represent mother tongue; as of March 2023, Romanian replaced Moldovan as the name of Moldova's official languagemajor-language sample(s): Cartea informativa a lumii, sursa indispensabila pentru informatii de baza. (Moldovan/Romanian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Monaco",
        "languageInfo": "French (official), English, Italian, Monegasquemajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Mongolia",
        "languageInfo": "Mongolian 90% (official) (Khalkha dialect is predominant), Turkic, Russian (1999)major-language sample(s): Дэлхийн баримтат ном, үндсэн мэдээллийн зайлшгүй эх сурвалж. (Mongolian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Montenegro",
        "languageInfo": "Serbian 42.9%, Montenegrin (official) 37%, Bosnian 5.3%, Albanian 5.3%, Serbo-Croat 2%, other 3.5%, unspecified 4% (2011 est.)major-language sample(s): Knjiga svetskih činjenica, neophodan izvor osnovnih informacija. (Serbian) Knjiga svjetskih činjenica, neophodan izvor osnovnih informacija. (Montenegrin/Bosnian)The World Factbook, the indispensable source for basic information."
    },
    { "heading": "Montserrat", "languageInfo": "English" },
    {
        "heading": "Morocco",
        "languageInfo": "Arabic (official), Berber languages (Tamazight (official), Tachelhit, Tarifit), French (often the language of business, government, and diplomacy); note - the proportion of Berber speakers is disputedmajor-language sample(s): كتاب ديال لحقائق متاع العالم، احسن مصدر متاع المعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Mozambique",
        "languageInfo": "Makhuwa 26.1%, Portuguese (official) 16.6%, Tsonga 8.6%, Nyanja 8.1, Sena 7.1%, Lomwe 7.1%, Chuwabo 4.7%, Ndau 3.8%, Tswa 3.8%, other Mozambican languages 11.8%, other 0.5%, unspecified 1.8% (2017 est.)"
    },
    {
        "heading": "Namibia",
        "languageInfo": "Oshiwambo languages 49.7%, Nama/Damara 11%, Kavango languages 10.4%, Afrikaans 9.4% (also a common language), Herero languages 9.2%, Zambezi languages 4.9%, English (official) 2.3%, other African languages 1.5%, other European languages 0.7%, other 1% (2016 est.)note: Namibia has 13 recognized national languages, including 10 indigenous African languages and 3 European languages"
    },
    {
        "heading": "Nauru",
        "languageInfo": "Nauruan 93% (official, a distinct Pacific Island language), English 2% (widely understood, spoken, and used for most government and commercial purposes), other 5% (includes Gilbertese 2% and Chinese 2%) (2011 est.)note: data represent main language spoken at home; Nauruan is spoken by 95% of the population, English by 66%, and other languages by 12%"
    },
    {
        "heading": "Nepal",
        "languageInfo": "Nepali (official) 44.6%, Maithali 11.7%, Bhojpuri 6%, Tharu 5.8%, Tamang 5.1%, Newar 3.2%, Bajjika 3%, Magar 3%, Doteli 3%, Urdu 2.6%, Avadhi 1.9%, Limbu 1.3%, Gurung 1.2%, Baitadeli 1%, other 6.4%, unspecified 0.2%; note - 123 languages reported as mother tongue in 2011 national census; many in government and business also speak English (2011 est.)major-language sample(s): विश्व तथ्य पुस्तक,आधारभूत जानकारीको लागि अपरिहार्य स्रोत (Nepali)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Netherlands",
        "languageInfo": "Dutch (official); note - Frisian is an official language in Fryslan province; Frisian, Low Saxon, Limburgish, Romani, and Yiddish have protected status under the European Charter for Regional or Minority Languages; Dutch is the official language of the three special municipalities of the Caribbean Netherlands; English is a recognized regional language on Sint Eustatius and Saba; Papiamento is a recognized regional language on Bonairemajor-language sample(s): Het Wereld Feitenboek, een onmisbare bron van informatie. (Dutch)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "New Caledonia",
        "languageInfo": "French (official), 33 Melanesian-Polynesian dialectsmajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "New Zealand",
        "languageInfo": "English (de facto official) 95.4%, Maori (de jure official) 4%, Samoan 2.2%, Northern Chinese 2%, Hindi 1.5%, French 1.2%, Yue 1.1%, New Zealand Sign Language (de jure official) 0.5%, other or not stated 17.2% (2018 est.)note: shares sum to 124.1% due to multiple responses on the 2018 census"
    },
    {
        "heading": "Nicaragua",
        "languageInfo": "Spanish (official) 95.3%, Miskito 2.2%, Mestizo of the Caribbean coast 2%, other 0.5%; note - English and indigenous languages found on the Caribbean coast (2005 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    { "heading": "Niger", "languageInfo": "French (official), Hausa, Djerma" },
    {
        "heading": "Nigeria",
        "languageInfo": "English (official), Hausa, Yoruba, Igbo (Ibo), Fulani, over 500 additional indigenous languages"
    },
    {
        "heading": "Niue",
        "languageInfo": "Niuean (official) 46% (a Polynesian language closely related to Tongan and Samoan), Niuean and English 32%, English (official) 11%, Niuean and others 5%, other 6% (2011 est.)"
    },
    {
        "heading": "Norfolk Island",
        "languageInfo": "English (official) 44.9%, Norfolk (official; also known as Norfuk or Norf'k, which is a mixture of 18th century English and ancient Tahitian) 40.3%, Fijian 1.8%, other 6.8%, unspecified 6.2% (2016 est.)note: data represent language spoken at home"
    },
    {
        "heading": "North Macedonia",
        "languageInfo": "Macedonian (official) 61.4%, Albanian (official) 24.3%, Turkish 3.4%, Romani 1.7%, other (includes Aromanian (Vlach) and Bosnian) 2%, persons for whom data were taken from administrative sources and no language data was available 7.2% (2021 est.); note - data represent mother tongue; minority languages are co-official with Macedonian in municipalities where they are spoken by at least 20% of the population; Albanian is co-official in Tetovo, Brvenica, Vrapciste, and other municipalities; Turkish is co-official in Centar Zupa and Plasnica; Romani is co-official in Suto Orizari; Aromanian is co-official in Krusevo; Serbian is co-official in Cucer Sandevomajor-language sample(s): Книга на Светски Факти, неопходен извор на основни информации. (Macedonian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Northern Mariana Islands",
        "languageInfo": "Philippine languages 32.8%, Chamorro (official) 24.1%, English (official) 17%, other Pacific island languages 10.1% (includes Carolinian (official), Chinese 6.8%, other Asian languages 7.3%, other 1.9% (2010 est.)"
    },
    {
        "heading": "Norway",
        "languageInfo": "Bokmal Norwegian (official), Nynorsk Norwegian (official), small Sami- and Finnish-speaking minorities; note - Sami has three dialects: Lule, North Sami, and South Sami; Sami is an official language in nine municipalities in Norway's three northernmost counties: Finnmark, Nordland, and Tromsmajor-language sample(s): Verdens Faktabok, den essensielle kilden for grunnleggende informasjon. (Norwegian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Oman",
        "languageInfo": "Arabic (official), English, Baluchi, Swahili, Urdu, Indian dialectsmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Pakistan",
        "languageInfo": "Punjabi 48%, Sindhi 12%, Saraiki (a Punjabi variant) 10%, Pashto (alternate name, Pashtu) 8%, Urdu (official) 8%, Balochi 3%, Hindko 2%, Brahui 1%, English (official; lingua franca of Pakistani elite and most government ministries), Burushaski, and other 8%major-language sample(s): ਸੰਸਾਰ ਦੀ ਤੱਥ ਕਿਤਾਬ, ਆਧਾਰੀ ਜਾਣਕਾਰੀ ਲਈ ਜ਼ਰੂਰੀ ਸਰੋਤ ਹੈ (Punjabi)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Palau",
        "languageInfo": "Palauan (official on most islands) 65.2%, other Micronesian 1.9%, English (official) 19.1%, Filipino 9.9%, Chinese 1.2%, other 2.8% (2015 est.)note: Sonsoralese is official in Sonsoral; Tobian is official in Tobi; Angaur and Japanese are official in Angaur"
    },
    {
        "heading": "Panama",
        "languageInfo": "Spanish (official), indigenous languages (including Ngabere (or Guaymi), Buglere, Kuna, Embera, Wounaan, Naso (or Teribe), and Bri Bri), Panamanian English Creole (similar to Jamaican English Creole; a mixture of English and Spanish with elements of Ngabere; also known as Guari Guari and Colon Creole), English, Chinese (Yue and Hakka), Arabic, French Creole, other (Yiddish, Hebrew, Korean, Japanese); note - many Panamanians are bilingualmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Papua New Guinea",
        "languageInfo": "Tok Pisin (official), English (official), Hiri Motu (official), some 839 indigenous languages spoken (about 12% of the world's total); many languages have fewer than 1,000 speakersnote: Tok Pisin, a creole language, is widely used and understood; English is spoken by 1%-2%; Hiri Motu is spoken by less than 2%"
    },
    {
        "heading": "Paraguay",
        "languageInfo": "Spanish (official) and Guarani (official) 46.3%, only Guarani 34%, only Spanish 15.2%, other (includes Portuguese, German, other Indigenous languages) 4.1%, no response 0.4%; note - data represent predominant household language (2012 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Peru",
        "languageInfo": "Spanish (official) 82.9%, Quechua (official) 13.6%, Aymara (official) 1.6%, Ashaninka 0.3%, other native languages (includes a large number of minor Amazonian languages) 0.8%, other (includes foreign languages and sign language) 0.2%, none 0.1%, unspecified 0.7% (2017 est.)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Philippines",
        "languageInfo": "unspecified Filipino (official; based on Tagalog) and English (official); eight major dialects - Tagalog, Cebuano, Ilocano, Hiligaynon or Ilonggo, Bicol, Waray, Pampango, and Pangasinanmajor-language sample(s): Ang World Factbook, ang mapagkukunan ng kailangang impormasyon. (Tagalog)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Pitcairn Islands",
        "languageInfo": "English (official), Pitkern (mixture of an 18th century English dialect and a Tahitian dialect)"
    },
    {
        "heading": "Poland",
        "languageInfo": "Polish (official) 98.2%, Silesian 1.4%, other 1.1%, unspecified 1.2%; note - data represent the language spoken at home; shares sum to more than 100% because some respondents gave more than one answer on the census; Poland ratified the European Charter for Regional or Minority Languages in 2009 recognizing Kashub as a regional language, Czech, Hebrew, Yiddish, Belarusian, Lithuanian, German, Armenian, Russian, Slovak, and Ukrainian as national minority languages, and Karaim, Lemko, Romani (Polska Roma and Bergitka Roma), and Tatar as ethnic minority languages (2011 est.)major-language sample(s): Księga Faktów Świata, niezbędne źródło podstawowych informacji. (Polish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Portugal",
        "languageInfo": "Portuguese (official), Mirandese (official, but locally used)"
    },
    {
        "heading": "Puerto Rico",
        "languageInfo": "Spanish Englishmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Qatar",
        "languageInfo": "Arabic (official), English commonly used as a second languagemajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Romania",
        "languageInfo": "Romanian (official) 91.6%, Hungarian 6.3%, Romani 1.2%, other 0.7% (2021 est.)note: data represent individuals who declared a maternal language in the 2021 national census; 13.1% did not respondmajor-language sample(s): Cartea informativa a lumii, sursa indispensabila pentru informatii de baza. (Romanian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Russia",
        "languageInfo": "Russian (official) 85.7%, Tatar 3.2%, Chechen 1%, other 10.1%; note - data represent native language spoken (2010 est.)major-language sample(s): Книга фактов о мире – незаменимый источник базовой информации. (Russian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Rwanda",
        "languageInfo": "Kinyarwanda (official, universal Bantu vernacular) 93.2%, French (official) <0.1, English (official) <0.1, Swahili/Kiswahili (official, used in commercial centers) <0.1, more than one language, other 6.3%, unspecified 0.3% (2002 est.)major-language sample(s): Inkoranya nzimbuzi y'isi, isoko fatizo y'amakuru y'ibanze. (Kinyarwanda)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Saint Barthelemy",
        "languageInfo": "French (primary), Englishmajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Saint Helena, Ascension, and Tristan da Cunha",
        "languageInfo": "English"
    },
    {
        "heading": "Saint Kitts and Nevis",
        "languageInfo": "English (official)"
    },
    {
        "heading": "Saint Lucia",
        "languageInfo": "English (official), Saint Lucian Creole"
    },
    {
        "heading": "Saint Martin",
        "languageInfo": "French (official), Dutch, English, Guadeloupian Creole, Haitian Creole, Italian, Martiniquan Creole, Papiamento (dialect of Netherlands Antilles), Spanishmajor-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Saint Pierre and Miquelon",
        "languageInfo": "French (official)major-language sample(s): The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Saint Vincent and the Grenadines",
        "languageInfo": "English, Vincentian Creole English, French patois"
    },
    {
        "heading": "Samoa",
        "languageInfo": "Samoan (Polynesian) (official) 91.1%, Samoan/English 6.7%, English (official) 0.5%, other 0.2%, unspecified 1.6% (2006 est.)"
    },
    {
        "heading": "San Marino",
        "languageInfo": "Italian major-language sample(s): L'Almanacco dei fatti del mondo, l'indispensabile fonte per le informazioni di base. (Italian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Sao Tome and Principe",
        "languageInfo": "Portuguese 98.4% (official), Forro 36.2%, Cabo Verdian 8.5%, French 6.8%, Angolar 6.6%, English 4.9%, Lunguie 1%, other (including sign language) 2.4%; note - shares sum to more than 100% because some respondents gave more than one answer on the census; other Portuguese-based Creoles are also spoken (2012 est.)"
    },
    {
        "heading": "Saudi Arabia",
        "languageInfo": "Arabic (official)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Senegal",
        "languageInfo": "French (official), Wolof, Pular, Jola, Mandinka, Serer, Soninke"
    },
    {
        "heading": "Serbia",
        "languageInfo": "Serbian (official) 88.1%, Hungarian 3.4%, Bosnian 1.9%, Romani 1.4%, other 3.4%, undeclared or unknown 1.8%; note - Serbian, Hungarian, Slovak, Romanian, Croatian, and Ruthenian (Rusyn) are official in the Autonomous Province of Vojvodina; most ethnic Albanians boycotted the 2011 census (2011 est.)major-language sample(s): Knjiga svetskih činjenica, neophodan izvor osnovnih informacija. (Serbian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Seychelles",
        "languageInfo": "Seychellois Creole (official) 89.1%, English (official) 5.1%, French (official) 0.7%, other 3.8%, unspecified 1.4% (2010 est.)"
    },
    {
        "heading": "Sierra Leone",
        "languageInfo": "English (official, regular use limited to literate minority), Mende (principal vernacular in the south), Temne (principal vernacular in the north), Krio (English-based Creole, spoken by the descendants of freed Jamaican slaves who were settled in the Freetown area, a lingua franca and a first language for 10% of the population but understood by 95%)"
    },
    {
        "heading": "Singapore",
        "languageInfo": "English (official) 48.3%, Mandarin (official) 29.9%, other Chinese dialects (includes Hokkien, Cantonese, Teochew, Hakka) 8.7%, Malay (official) 9.2%, Tamil (official) 2.5%, other 1.4%; note - data represent language most frequently spoken at home (2020 est.)major-language sample(s): The World Factbook, the indispensable source for basic information. (English)世界概況  –  不可缺少的基本消息來源 (Mandarin)"
    },
    {
        "heading": "Sint Maarten",
        "languageInfo": "English (official) 67.5%, Spanish 12.9%, Creole 8.2%, Dutch (official) 4.2%, Papiamento (a Spanish-Portuguese-Dutch-English dialect) 2.2%, French 1.5%, other 3.5% (2001 est.)"
    },
    {
        "heading": "Slovakia",
        "languageInfo": "Slovak (official) 81.8%, Hungarian 8.5%, Roma 1.8%, other 2.2%, unspecified 5.7% (2021 est.)major-language sample(s): Svetova Kniha Faktov, nenahraditelny zdroj zakladnej informacie. (Slovak)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Slovenia",
        "languageInfo": "Slovene (official) 87.7%, Croatian 2.8%, Serbo-Croatian 1.8%, Bosnian 1.6%, Serbian 1.6%, Hungarian 0.4% (official, only in municipalities where Hungarian national communities reside), Italian 0.2% (official, only in municipalities where Italian national communities reside), other or unspecified 3.9% (2002 est.)major-language sample(s): Svetovni informativni zvezek - neobhoden vir osnovnih informacij. (Slovene)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Solomon Islands",
        "languageInfo": "Melanesian pidgin (in much of the country is lingua franca), English (official but spoken by only 1%-2% of the population), 120 indigenous languages"
    },
    {
        "heading": "Somalia",
        "languageInfo": "Somali (official, according to the 2012 Transitional Federal Charter), Arabic (official, according to the 2012 Transitional Federal Charter), Italian, Englishmajor-language sample(s): Buugga Xaqiiqda Aduunka, waa laga maarmaanka macluumaadka assasiga. (Somali)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "South Africa",
        "languageInfo": "isiZulu (official) 25.3%, isiXhosa (official) 14.8%, Afrikaans (official) 12.2%, Sepedi (official) 10.1%, Setswana (official) 9.1%, English (official) 8.1%, Sesotho (official) 7.9%, Xitsonga (official) 3.6%, siSwati (official) 2.8%, Tshivenda (official) 2.5%, isiNdebele (official) 1.6%, other (includes Khoi, Nama, and San languages) 2%; note - data represent language spoken most often at home (2018 est.)major-language sample(s): Die Wereld Feite Boek, n’ onontbeerlike bron vir basiese informasie. (Afrikaans)The World Factbook, the indispensable source for basic information. (English)"
    },
    {
        "heading": "South Sudan",
        "languageInfo": "English (official), Arabic (includes Juba and Sudanese variants), ethnic languages include Dinka, Nuer, Bari, Zande, Shillukmajor-language sample(s): The World Factbook, the indispensable source for basic information. (English)كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)"
    },
    {
        "heading": "Spain",
        "languageInfo": "Castilian Spanish (official nationwide) 74%, Catalan (official in Catalonia, the Balearic Islands, and the Valencian Community (where it is known as Valencian)) 17%, Galician (official in Galicia) 7%, Basque (official in the Basque Country and in the Basque-speaking area of Navarre) 2%, Aranese (official in the northwest corner of Catalonia (Vall d'Aran) along with Catalan, <5,000 speakers); note - Aragonese, Aranese Asturian, Basque, Calo, Catalan, Galician, and Valencian are recognized as regional languages under the European Charter for Regional or Minority Languagesmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Sri Lanka",
        "languageInfo": "Sinhala (official and national language) 87%, Tamil (official and national language) 28.5%, English 23.8% (2012 est.)note: data represent main languages spoken by the population aged 10 years and older; shares sum to more than 100% because some respondents gave more than one answer on the census; English is commonly used in government and is referred to as the \"link language\" in the constitution"
    },
    {
        "heading": "Sudan",
        "languageInfo": "Arabic (official), English (official), Nubian, Ta Bedawie, Furmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information. (English)"
    },
    {
        "heading": "Suriname",
        "languageInfo": "Dutch (official), English (widely spoken), Sranang Tongo (Surinamese, sometimes called Taki-Taki, is the native language of Creoles and much of the younger population and is lingua franca among others), Caribbean Hindustani (a dialect of Hindi), Javanesemajor-language sample(s): Het Wereld Feitenboek, een omnisbare bron van informatie. (Dutch)The World Factbook, the indispensable source for basic information. (English)"
    },
    {
        "heading": "Svalbard",
        "languageInfo": "Norwegian, Russian major-language sample(s): Verdens Faktabok, den essensielle kilden for grunnleggende informasjon. (Norwegian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Sweden",
        "languageInfo": "Swedish (official)major-language sample(s): The World Factbook, den obestridliga källan för grundläggande information. (Swedish)The World Factbook, the indispensable source for basic information.note: Finnish, Sami, Romani, Yiddish, and Meankieli are official minority languages"
    },
    {
        "heading": "Switzerland",
        "languageInfo": "German (or Swiss German) (official) 62.1%, French (official) 22.8%, Italian (official) 8%, English 5.7%, Portuguese 3.5%, Albanian 3.3%, Serbo-Croatian 2.3%, Spanish 2.3%, Romansh (official) 0.5%, other 7.9%; note - German, French, Italian, and Romansh are all national and official languages; shares sum to more than 100% because respondents could indicate more than one main language (2019 est.)major-language sample(s): Das World Factbook, die unverzichtbare Quelle für grundlegende Informationen. (German)The World Factbook, une source indispensable d'informations de base. (French)L'Almanacco dei fatti del mondo, l'indispensabile fonte per le informazioni di base. (Italian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Syria",
        "languageInfo": "Arabic (official), Kurdish, Armenian, Aramaic, Circassian, French, Englishmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)ڕاستییەکانی جیهان، باشترین سەرچاوەیە بۆ زانیارییە بنەڕەتییەکان (Kurdish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Taiwan",
        "languageInfo": "Mandarin (official), Min Nan, Hakka dialects, approximately 16 indigenous languagesmajor-language sample(s): 世界概況  –  不可缺少的基本消息來源 (Mandarin)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Tajikistan",
        "languageInfo": "Tajik (official) 84.4%, Uzbek 11.9%, Kyrgyz 0.8%, Russian 0.5%, other 2.4% (2010 est.)major-language sample(s): Китоби Фактҳои Ҷаҳонӣ, манбаи бебадали маълумоти асосӣ (Tajik)The World Factbook, the indispensable source for basic information.note: Russian widely used in government and business"
    },
    {
        "heading": "Tanzania",
        "languageInfo": "Kiswahili or Swahili (official), Kiunguja (name for Swahili in Zanzibar), English (official, primary language of commerce, administration, and higher education), Arabic (widely spoken in Zanzibar), many local languages; note - Kiswahili (Swahili) is the mother tongue of the Bantu people living in Zanzibar and nearby coastal Tanzania; although Kiswahili is Bantu in structure and origin, its vocabulary draws on a variety of sources including Arabic and English; it has become the lingua franca of central and eastern Africa; the first language of most people is one of the local languagesmajor-language sample(s): The World Factbook, Chanzo cha Lazima Kuhusu Habari ya Msingi. (Kiswahili)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Thailand",
        "languageInfo": "Thai (official) only 90.7%, Thai and other languages 6.4%, only other languages 2.9% (includes Malay, Burmese); note - data represent population by language(s) spoken at home; English is a secondary language of the elite (2010 est.)major-language sample(s): สารานุกรมโลก - แหล่งข้อมูลพื้นฐานที่สำคัญ (Thai)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Timor-Leste",
        "languageInfo": "Tetun Prasa 30.6%, Mambai 16.6%, Makasai 10.5%, Tetun Terik 6.1%, Baikenu 5.9%, Kemak 5.8%, Bunak 5.5%, Tokodede 4%, Fataluku 3.5%, Waima'a 1.8%, Galoli 1.4%, Naueti 1.4%, Idate 1.2%, Midiki 1.2%, other 4.5% (2015 est.)note: data represent population by mother tongue; Tetun and Portuguese are official languages; Indonesian and English are working languages; there are about 32 indigenous languages"
    },
    {
        "heading": "Togo",
        "languageInfo": "French (official, the language of commerce), Ewe and Mina (the two major African languages in the south), Kabye (sometimes spelled Kabiye) and Dagomba (the two major African languages in the north)"
    },
    {
        "heading": "Tokelau",
        "languageInfo": "Tokelauan 88.1% (a Polynesian language), English 48.6%, Samoan 26.7%, Tuvaluan 11.2%, Kiribati 1.5%, other 2.8%, none 2.8%, unspecified 0.8% (2016 ests.)note: shares sum to more than 100% because some respondents gave more than one answer on the census"
    },
    {
        "heading": "Tonga",
        "languageInfo": "Tongan and English 76.8%, Tongan, English, and other language 10.6%, Tongan only (official) 8.7%, English only (official) 0.7%, other 1.7%, none 2.2% (2016 est.)note: data represent persons aged 5 and older who can read and write a simple sentence in Tongan, English, or another language"
    },
    {
        "heading": "Trinidad and Tobago",
        "languageInfo": "English (official), Trinidadian Creole English, Tobagonian Creole English, Caribbean Hindustani (a dialect of Hindi), Trinidadian Creole French, Spanish, Chinese"
    },
    {
        "heading": "Tunisia",
        "languageInfo": "Arabic (official, one of the languages of commerce), French (commerce), Berber (Tamazight); note - despite having no official status, French plays a major role in the country and is spoken by about two thirds of the populationmajor-language sample(s): كتاب حقائق العالم، أحسن كتاب تتعلم به المعلومات الأساسية (Arabic)The World Factbook, une source indispensable d'informations de base. (French)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Turkey (Turkiye)",
        "languageInfo": "Turkish (official), Kurdish, other minority languagesmajor-language sample(s): The World Factbook, temel bilgi edinmek için vazgeçilmez bir kaynak. (Turkish) ڕاستییەکانی جیهان، باشترین سەرچاوەیە بۆ زانیارییە بنەڕەتییەکان (Kurdish) The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Turkmenistan",
        "languageInfo": "Turkmen (official) 72%, Russian 12%, Uzbek 9%, other 7%major-language sample(s): Dünýä Faktlar Kitaby – esasy maglumatlaryň wajyp çeşmesidir (Turkmen)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Turks and Caicos Islands",
        "languageInfo": "English (official)"
    },
    {
        "heading": "Tuvalu",
        "languageInfo": "Tuvaluan (official), English (official), Samoan, Kiribati (on the island of Nui)"
    },
    {
        "heading": "Uganda",
        "languageInfo": "English (official language, taught in schools, used in courts of law and by most newspapers and some radio broadcasts), Ganda or Luganda (most widely used of the Niger-Congo languages and the language used most often in the capital), other Niger-Congo languages, Nilo-Saharan languages, Swahili (official), Arabic"
    },
    {
        "heading": "Ukraine",
        "languageInfo": "Ukrainian (official) 67.5%, Russian (regional language) 29.6%, other (includes small Crimean Tatar-, Moldovan/Romanian-, and Hungarian-speaking minorities) 2.9% (2001 est.); note - in February 2018, the Constitutional Court ruled that 2012 language legislation entitling a language spoken by at least 10% of an oblast's population to be given the status of \"regional language\" - allowing for its use in courts, schools, and other government institutions - was unconstitutional, thus making the law invalid; Ukrainian remains the country's only official nationwide languagemajor-language sample(s): Свiтова Книга Фактiв – найкраще джерело базової інформації. (Ukrainian)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "United Arab Emirates",
        "languageInfo": "Arabic (official), English, Hindi, Malayam, Urdu, Pashto, Tagalog, Persianmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "United Kingdom",
        "languageInfo": "English note: the following are recognized regional languages: Scots (about 30% of the population of Scotland), Scottish Gaelic (about 60,000 speakers in Scotland), Welsh (about 20% of the population of Wales), Irish (about 10% of the population of Northern Ireland), Cornish (some 2,000 to 3,000 people in Cornwall) (2012 est.)"
    },
    {
        "heading": "United States",
        "languageInfo": "English only 78.2%, Spanish 13.4%, Chinese 1.1%, other 7.3% (2017 est.)note: data represent the language spoken at home; the US has no official national language, but English has acquired official status in 32 of the 50 states; Hawaiian is an official language in the state of Hawaii, and 20 indigenous languages are official in Alaska"
    },
    {
        "heading": "Uruguay",
        "languageInfo": "Spanish (official)major-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Uzbekistan",
        "languageInfo": "Uzbek (official) 74.3%, Russian 14.2%, Tajik 4.4%, other 7.1%major-language sample(s): Jahon faktlari kitobi, asosiy ma'lumotlar uchun zaruriy manba. (Uzbek)The World Factbook, the indispensable source for basic information.note: in the semi-autonomous Republic of Karakalpakstan, both the Karakalpak language and Uzbek have official status"
    },
    {
        "heading": "Vanuatu",
        "languageInfo": "local languages (more than 100) 63.2%, Bislama (official; creole) 33.7%, English (official) 2%, French (official) 0.6%, other 0.5% (2009 est.)"
    },
    {
        "heading": "Venezuela",
        "languageInfo": "Spanish (official), numerous indigenous dialectsmajor-language sample(s): La Libreta Informativa del Mundo, la fuente indispensable de información básica. (Spanish)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Vietnam",
        "languageInfo": "Vietnamese (official), English (increasingly favored as a second language), some French, Chinese, and Khmer, mountain area languages (Mon-Khmer and Malayo-Polynesian)major-language sample(s): Dữ kiện thế giới, là nguồn thông tin cơ bản không thể thiếu. (Vietnamese)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Virgin Islands",
        "languageInfo": "English 71.6%, Spanish or Spanish Creole 17.2%, French or French Creole 8.6%, other 2.5% (2010 est.)"
    },
    {
        "heading": "Wallis and Futuna",
        "languageInfo": "Wallisian (indigenous Polynesian language) 58.9%, Futunian 30.1%, French (official) 10.8%, other 0.2% (2003 est.)"
    },
    {
        "heading": "West Bank",
        "languageInfo": "Arabic, Hebrew (spoken by Israeli settlers and many Palestinians), English (widely understood)major-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "World",
        "languageInfo": "most-spoken language: English 18.8%, Mandarin Chinese 13.8%, Hindi 7.5%, Spanish 6.9%, French 3.4%, Arabic 3.4%, Bengali 3.4%, Russian 3.2%, Portuguese 3.2%, Urdu 2.9% (2022 est.) most-spoken first language: Mandarin Chinese 12.3%, Spanish 6%, English 5.1%, Arabic 5.1%, Hindi 3.5%, Bengali 3.3%, Portuguese 3%, Russian 2.1%, Japanese 1.7%, Punjabi, Western 1.3%, Javanese 1.1% (2018 est.) note 1: the six UN languages - Arabic, Chinese (Mandarin), English, French, Russian, and Spanish (Castilian) - are the mother tongue or second language of about 49.6% of the world's population (2022), and are the official languages in more than half the states in the world; some 400 languages have more than a million first-language speakers (2018) note 2: all told, there are estimated to be just over 7,151 languages spoken in the world (2022); approximately 80% of these languages are spoken by less than 100,000 people; about 150 languages are spoken by fewer than 10 people; communities that are isolated from each other in mountainous regions often develop multiple languages; Papua New Guinea, for example, boasts about 840 separate languages (2018) note 3: approximately 2,300 languages are spoken in Asia, 2,140, in Africa, 1,310 in the Pacific, 1,060 in the Americas, and 290 in Europe (2020)"
    },
    {
        "heading": "Yemen",
        "languageInfo": "Arabic (official); note - a distinct Socotri language is widely used on Socotra Island and Archipelago; Mahri is still fairly widely spoken in eastern Yemenmajor-language sample(s): كتاب حقائق العالم، المصدر الذي لا يمكن الاستغناء عنه للمعلومات الأساسية (Arabic)The World Factbook, the indispensable source for basic information."
    },
    {
        "heading": "Zambia",
        "languageInfo": "Bemba 33.4%, Nyanja 14.7%, Tonga 11.4%, Lozi 5.5%, Chewa 4.5%, Nsenga 2.9%, Tumbuka 2.5%, Lunda (North Western) 1.9%, Kaonde 1.8%, Lala 1.8%, Lamba 1.8%, English (official) 1.7%, Luvale 1.5%, Mambwe 1.3%, Namwanga 1.2%, Lenje 1.1%, Bisa 1%, other 9.7%, unspecified 0.2% (2010 est.)note: Zambia is said to have over 70 languages, although many of these may be considered dialects; all of Zambia's major languages are members of the Bantu family; Chewa and Nyanja are mutually intelligible dialects"
    },
    {
        "heading": "Zimbabwe",
        "languageInfo": "Shona (official; most widely spoken), Ndebele (official, second most widely spoken), English (official; traditionally used for official business), 13 minority languages (official; includes Chewa, Chibarwe, Kalanga, Koisan, Nambya, Ndau, Shangani, sign language, Sotho, Tonga, Tswana, Venda, and Xhosa)"
    }
]
